# Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
a = np.array([2,1,3])
b = np.array([4,2,6])

In [4]:
a+b

array([6, 3, 9])

* Series is a unidimensional structure
* Dataframe is a bidimensional structure

In [5]:
import pandas as pd

In [6]:
A = pd.Series(a, index = ["january","february","march"])
A

january     2
february    1
march       3
dtype: int64

In [7]:
B = pd.Series(b, index = ["january","february","march"])
B

january     4
february    2
march       6
dtype: int64

In [8]:
A + B

january     6
february    3
march       9
dtype: int64

In [9]:
a = pd.Series(np.random.randint(0,10,size=10), index = list("ABAAACBAAB"))
a

A    8
B    3
A    4
A    1
A    4
C    8
B    5
A    3
A    5
B    7
dtype: int64

In [10]:
a.groupby(a.index).mean()

A    4.166667
B    5.000000
C    8.000000
dtype: float64

In [11]:
a.index

Index(['A', 'B', 'A', 'A', 'A', 'C', 'B', 'A', 'A', 'B'], dtype='object')

In [12]:
a.head()

A    8
B    3
A    4
A    1
A    4
dtype: int64

In [13]:
a.tail()

C    8
B    5
A    3
A    5
B    7
dtype: int64

In [14]:
a.sample()

B    5
dtype: int64

In [15]:
a.describe()

count    10.000000
mean      4.800000
std       2.299758
min       1.000000
25%       3.250000
50%       4.500000
75%       6.500000
max       8.000000
dtype: float64

In [16]:
a.dtype

dtype('int64')

In [17]:
B

january     4
february    2
march       6
dtype: int64

In [18]:
B[0]

4

In [19]:
B['january']

4

In [20]:
C = pd.Series([2,1,3], index=[2,0,1]) # index describes explicit labels
C

2    2
0    1
1    3
dtype: int64

In [21]:
C[2]

2

In [22]:
B.loc['january'] # .loc to explicit label

4

In [23]:
B.iloc[0] # .iloc to implicit label

4

In [24]:
C.iloc[1]

1

In [25]:
C.loc[1]

3

In [26]:
a["A"]

A    8
A    4
A    1
A    4
A    3
A    5
dtype: int64

In [27]:
a.iloc[3]

1

In [28]:
a.loc["A"]

A    8
A    4
A    1
A    4
A    3
A    5
dtype: int64

In [29]:
b = pd.Series(np.random.randint(0,10, size=10), index = list("ABCDEFGHIJ"))
b

A    8
B    0
C    5
D    6
E    0
F    4
G    7
H    1
I    3
J    9
dtype: int64

In [30]:
b['B':'E']

B    0
C    5
D    6
E    0
dtype: int64

In [31]:
b[2:4]

C    5
D    6
dtype: int64

In [32]:
b.loc['B':'E']

B    0
C    5
D    6
E    0
dtype: int64

In [33]:
df = pd.DataFrame(np.random.randint(0,10, size=(6,4)), index=list("ABCDEF"), columns = ['jan', 'feb','mar','apr'])
df

   jan  feb  mar  apr
A    3    9    4    9
B    2    5    9    9
C    3    7    2    1
D    3    7    2    7
E    1    7    9    8
F    6    8    6    8

In [34]:
df.ndim

2

In [35]:
df.shape

(6, 4)

In [36]:
len(df) # number of rows

6

In [37]:
df.dtypes

jan    int64
feb    int64
mar    int64
apr    int64
dtype: object

In [38]:
df.head(3)

   jan  feb  mar  apr
A    3    9    4    9
B    2    5    9    9
C    3    7    2    1

In [39]:
df.describe()

           jan       feb       mar      apr
count  6.00000  6.000000  6.000000  6.00000
mean   3.00000  7.166667  5.333333  7.00000
std    1.67332  1.329160  3.204164  3.03315
min    1.00000  5.000000  2.000000  1.00000
25%    2.25000  7.000000  2.500000  7.25000
50%    3.00000  7.000000  5.000000  8.00000
75%    3.00000  7.750000  8.250000  8.75000
max    6.00000  9.000000  9.000000  9.00000

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to F
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   jan     6 non-null      int64
 1   feb     6 non-null      int64
 2   mar     6 non-null      int64
 3   apr     6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes

In [41]:
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [42]:
df.columns

Index(['jan', 'feb', 'mar', 'apr'], dtype='object')

In [43]:
df['feb']

A    9
B    5
C    7
D    7
E    7
F    8
Name: feb, dtype: int64

In [44]:
df.feb # this is not very safe

A    9
B    5
C    7
D    7
E    7
F    8
Name: feb, dtype: int64

In [45]:
df[2:4]

   jan  feb  mar  apr
C    3    7    2    1
D    3    7    2    7

In [46]:
df['B':'E'] # extract rows

   jan  feb  mar  apr
B    2    5    9    9
C    3    7    2    1
D    3    7    2    7
E    1    7    9    8

In [47]:
df[['mar','jan']] # extrat columns

   mar  jan
A    4    3
B    9    2
C    2    3
D    2    3
E    9    1
F    6    6

In [48]:
df[[True, False, True, False, True, False]]

   jan  feb  mar  apr
A    3    9    4    9
C    3    7    2    1
E    1    7    9    8

In [49]:
df.jan

A    3
B    2
C    3
D    3
E    1
F    6
Name: jan, dtype: int64

In [50]:
df.jan > 4

A    False
B    False
C    False
D    False
E    False
F     True
Name: jan, dtype: bool

In [51]:
df[df.jan > 4]

   jan  feb  mar  apr
F    6    8    6    8

In [52]:
df[df.jan==8].jan.index

Index([], dtype='object')

In [53]:
list(df[df.jan==8].index)

[]

In [54]:
df

   jan  feb  mar  apr
A    3    9    4    9
B    2    5    9    9
C    3    7    2    1
D    3    7    2    7
E    1    7    9    8
F    6    8    6    8

In [55]:
df.iloc[1,1]

5

In [56]:
df.iloc[2:4,1:3]

   feb  mar
C    7    2
D    7    2

In [57]:
df.loc[['B','E','A'],[True, False, True, False]]

   jan  mar
B    2    9
E    1    9
A    3    4

In [58]:
df.idxmax(axis=1)

A    feb
B    mar
C    feb
D    feb
E    mar
F    feb
dtype: object

In [59]:
import seaborn as sns

In [60]:
tips = sns.load_dataset("tips")

### .values

In [61]:
tips.sex.values[:5]

['Female', 'Male', 'Male', 'Male', 'Female']
Categories (2, object): ['Male', 'Female']

In [62]:
tips.tip.values

array([ 1.01,  1.66,  3.5 ,  3.31,  3.61,  4.71,  2.  ,  3.12,  1.96,
        3.23,  1.71,  5.  ,  1.57,  3.  ,  3.02,  3.92,  1.67,  3.71,
        3.5 ,  3.35,  4.08,  2.75,  2.23,  7.58,  3.18,  2.34,  2.  ,
        2.  ,  4.3 ,  3.  ,  1.45,  2.5 ,  3.  ,  2.45,  3.27,  3.6 ,
        2.  ,  3.07,  2.31,  5.  ,  2.24,  2.54,  3.06,  1.32,  5.6 ,
        3.  ,  5.  ,  6.  ,  2.05,  3.  ,  2.5 ,  2.6 ,  5.2 ,  1.56,
        4.34,  3.51,  3.  ,  1.5 ,  1.76,  6.73,  3.21,  2.  ,  1.98,
        3.76,  2.64,  3.15,  2.47,  1.  ,  2.01,  2.09,  1.97,  3.  ,
        3.14,  5.  ,  2.2 ,  1.25,  3.08,  4.  ,  3.  ,  2.71,  3.  ,
        3.4 ,  1.83,  5.  ,  2.03,  5.17,  2.  ,  4.  ,  5.85,  3.  ,
        3.  ,  3.5 ,  1.  ,  4.3 ,  3.25,  4.73,  4.  ,  1.5 ,  3.  ,
        1.5 ,  2.5 ,  3.  ,  2.5 ,  3.48,  4.08,  1.64,  4.06,  4.29,
        3.76,  4.  ,  3.  ,  1.  ,  4.  ,  2.55,  4.  ,  3.5 ,  5.07,
        1.5 ,  1.8 ,  2.92,  2.31,  1.68,  2.5 ,  2.  ,  2.52,  4.2 ,
        1.48,  2.  ,  2.  ,  2.18,  1.5 ,  2.83,  1.5 ,  2.  ,  3.25,
        1.25,  2.  ,  2.  ,  2.  ,  2.75,  3.5 ,  6.7 ,  5.  ,  5.  ,
        2.3 ,  1.5 ,  1.36,  1.63,  1.73,  2.  ,  2.5 ,  2.  ,  2.74,
        2.  ,  2.  ,  5.14,  5.  ,  3.75,  2.61,  2.  ,  3.5 ,  2.5 ,
        2.  ,  2.  ,  3.  ,  3.48,  2.24,  4.5 ,  1.61,  2.  , 10.  ,
        3.16,  5.15,  3.18,  4.  ,  3.11,  2.  ,  2.  ,  4.  ,  3.55,
        3.68,  5.65,  3.5 ,  6.5 ,  3.  ,  5.  ,  3.5 ,  2.  ,  3.5 ,
        4.  ,  1.5 ,  4.19,  2.56,  2.02,  4.  ,  1.44,  2.  ,  5.  ,
        2.  ,  2.  ,  4.  ,  2.01,  2.  ,  2.5 ,  4.  ,  3.23,  3.41,
        3.  ,  2.03,  2.23,  2.  ,  5.16,  9.  ,  2.5 ,  6.5 ,  1.1 ,
        3.  ,  1.5 ,  1.44,  3.09,  2.2 ,  3.48,  1.92,  3.  ,  1.58,
        2.5 ,  2.  ,  3.  ,  2.72,  2.88,  2.  ,  3.  ,  3.39,  1.47,
        3.  ,  1.25,  1.  ,  1.17,  4.67,  5.92,  2.  ,  2.  ,  1.75,
        3.  ])

### .value_counts()

In [63]:
tips.sex.value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [64]:
tips.tip.value_counts()

2.00    33
3.00    23
4.00    12
5.00    10
2.50    10
        ..
4.34     1
1.56     1
5.20     1
2.60     1
1.75     1
Name: tip, Length: 123, dtype: int64

In [65]:
tips.value_counts()

total_bill  tip    sex     smoker  day   time    size
13.00       2.00   Female  Yes     Thur  Lunch   2       2
3.07        1.00   Female  Yes     Sat   Dinner  1       1
22.23       5.00   Male    No      Sun   Dinner  2       1
20.69       2.45   Female  No      Sat   Dinner  4       1
            5.00   Male    No      Sun   Dinner  5       1
                                                        ..
15.53       3.00   Male    Yes     Sat   Dinner  2       1
15.69       1.50   Male    Yes     Sun   Dinner  2       1
            3.00   Male    Yes     Sat   Dinner  3       1
15.77       2.23   Female  No      Sat   Dinner  2       1
50.81       10.00  Male    Yes     Sat   Dinner  3       1
Length: 243, dtype: int64

In [66]:
tips.value_counts(subset=["sex","smoker"])

sex     smoker
Male    No        97
        Yes       60
Female  No        54
        Yes       33
dtype: int64

In [67]:
tips.tip.unique()

array([ 1.01,  1.66,  3.5 ,  3.31,  3.61,  4.71,  2.  ,  3.12,  1.96,
        3.23,  1.71,  5.  ,  1.57,  3.  ,  3.02,  3.92,  1.67,  3.71,
        3.35,  4.08,  2.75,  2.23,  7.58,  3.18,  2.34,  4.3 ,  1.45,
        2.5 ,  2.45,  3.27,  3.6 ,  3.07,  2.31,  2.24,  2.54,  3.06,
        1.32,  5.6 ,  6.  ,  2.05,  2.6 ,  5.2 ,  1.56,  4.34,  3.51,
        1.5 ,  1.76,  6.73,  3.21,  1.98,  3.76,  2.64,  3.15,  2.47,
        1.  ,  2.01,  2.09,  1.97,  3.14,  2.2 ,  1.25,  3.08,  4.  ,
        2.71,  3.4 ,  1.83,  2.03,  5.17,  5.85,  3.25,  4.73,  3.48,
        1.64,  4.06,  4.29,  2.55,  5.07,  1.8 ,  2.92,  1.68,  2.52,
        4.2 ,  1.48,  2.18,  2.83,  6.7 ,  2.3 ,  1.36,  1.63,  1.73,
        2.74,  5.14,  3.75,  2.61,  4.5 ,  1.61, 10.  ,  3.16,  5.15,
        3.11,  3.55,  3.68,  5.65,  6.5 ,  4.19,  2.56,  2.02,  1.44,
        3.41,  5.16,  9.  ,  1.1 ,  3.09,  1.92,  1.58,  2.72,  2.88,
        3.39,  1.47,  1.17,  4.67,  5.92,  1.75])

In [68]:
tips.tip.nunique()

123

### .drop()

In [69]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [70]:
tips.head().drop([2])

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [71]:
tips.head().drop(['smoker'], axis=1)

   total_bill   tip     sex  day    time  size
0       16.99  1.01  Female  Sun  Dinner     2
1       10.34  1.66    Male  Sun  Dinner     3
2       21.01  3.50    Male  Sun  Dinner     3
3       23.68  3.31    Male  Sun  Dinner     2
4       24.59  3.61  Female  Sun  Dinner     4

In [72]:
np.square(tips.tip)

0       1.0201
1       2.7556
2      12.2500
3      10.9561
4      13.0321
        ...
239    35.0464
240     4.0000
241     4.0000
242     3.0625
243     9.0000
Name: tip, Length: 244, dtype: float64

Many numpy functions have their simile in pandas.

In [73]:
tips.tip.max()

10.0

In [74]:
np.max(tips.tip)

10.0

### .set_index()

In [75]:
tips.set_index('sex')

        total_bill   tip smoker   day    time  size
sex
Female       16.99  1.01     No   Sun  Dinner     2
Male         10.34  1.66     No   Sun  Dinner     3
Male         21.01  3.50     No   Sun  Dinner     3
Male         23.68  3.31     No   Sun  Dinner     2
Female       24.59  3.61     No   Sun  Dinner     4
...            ...   ...    ...   ...     ...   ...
Male         29.03  5.92     No   Sat  Dinner     3
Female       27.18  2.00    Yes   Sat  Dinner     2
Male         22.67  2.00    Yes   Sat  Dinner     2
Male         17.82  1.75     No   Sat  Dinner     2
Female       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [76]:
tips.set_index(['sex','smoker'])

               total_bill   tip   day    time  size
sex    smoker
Female No           16.99  1.01   Sun  Dinner     2
Male   No           10.34  1.66   Sun  Dinner     3
       No           21.01  3.50   Sun  Dinner     3
       No           23.68  3.31   Sun  Dinner     2
Female No           24.59  3.61   Sun  Dinner     4
...                   ...   ...   ...     ...   ...
Male   No           29.03  5.92   Sat  Dinner     3
Female Yes          27.18  2.00   Sat  Dinner     2
Male   Yes          22.67  2.00   Sat  Dinner     2
       No           17.82  1.75   Sat  Dinner     2
Female No           18.78  3.00  Thur  Dinner     2

[244 rows x 5 columns]

### .sort

In [77]:
tips.tip.sort_values()

67      1.00
236     1.00
92      1.00
111     1.00
0       1.01
       ...
141     6.70
59      6.73
23      7.58
212     9.00
170    10.00
Name: tip, Length: 244, dtype: float64

In [78]:
tips.tip.sort_index(ascending=False)

243    3.00
242    1.75
241    2.00
240    2.00
239    5.92
       ...
4      3.61
3      3.31
2      3.50
1      1.66
0      1.01
Name: tip, Length: 244, dtype: float64

In [79]:
tips.sort_index(axis=1)

      day     sex  size smoker    time   tip  total_bill
0     Sun  Female     2     No  Dinner  1.01       16.99
1     Sun    Male     3     No  Dinner  1.66       10.34
2     Sun    Male     3     No  Dinner  3.50       21.01
3     Sun    Male     2     No  Dinner  3.31       23.68
4     Sun  Female     4     No  Dinner  3.61       24.59
..    ...     ...   ...    ...     ...   ...         ...
239   Sat    Male     3     No  Dinner  5.92       29.03
240   Sat  Female     2    Yes  Dinner  2.00       27.18
241   Sat    Male     2    Yes  Dinner  2.00       22.67
242   Sat    Male     2     No  Dinner  1.75       17.82
243  Thur  Female     2     No  Dinner  3.00       18.78

[244 rows x 7 columns]

### .remane

In [80]:
tips.rename({'size':'people', 'sex':'gender'}, axis=1)

     total_bill   tip  gender smoker   day    time  people
0         16.99  1.01  Female     No   Sun  Dinner       2
1         10.34  1.66    Male     No   Sun  Dinner       3
2         21.01  3.50    Male     No   Sun  Dinner       3
3         23.68  3.31    Male     No   Sun  Dinner       2
4         24.59  3.61  Female     No   Sun  Dinner       4
..          ...   ...     ...    ...   ...     ...     ...
239       29.03  5.92    Male     No   Sat  Dinner       3
240       27.18  2.00  Female    Yes   Sat  Dinner       2
241       22.67  2.00    Male    Yes   Sat  Dinner       2
242       17.82  1.75    Male     No   Sat  Dinner       2
243       18.78  3.00  Female     No  Thur  Dinner       2

[244 rows x 7 columns]

In [81]:
tips.index

RangeIndex(start=0, stop=244, step=1)

In [82]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

## Application of functions and mapping

### Series

In [83]:
tips.tip.head()

0    1.01
1    1.66
2    3.50
3    3.31
4    3.61
Name: tip, dtype: float64

In [84]:
def cube(n):
    return n**3

In [85]:
tips.tip.apply(cube)

0        1.030301
1        4.574296
2       42.875000
3       36.264691
4       47.045881
          ...
239    207.474688
240      8.000000
241      8.000000
242      5.359375
243     27.000000
Name: tip, Length: 244, dtype: float64

In [86]:
tips.sex.map({'Male':'M','Female':'F'})

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: category
Categories (2, object): ['M', 'F']

### Dataframes

In [87]:
df = tips[['total_bill','tip','size']].copy()

In [88]:
def range(s):
    return s.max() - s.min()

In [89]:
df.apply(range)

total_bill    47.74
tip            9.00
size           5.00
dtype: float64

In [90]:
df.apply(range, axis=1)

0      15.98
1       8.68
2      18.01
3      21.68
4      20.98
       ...
239    26.03
240    25.18
241    20.67
242    16.07
243    16.78
Length: 244, dtype: float64

To apply a function to all the values in the dataframe like in the Series the function is `applymap`

In [91]:
df.applymap(cube)

       total_bill         tip  size
0     4904.335099    1.030301     8
1     1105.507304    4.574296    27
2     9274.236301   42.875000    27
3    13278.380032   36.264691     8
4    14868.788579   47.045881    64
..            ...         ...   ...
239  24464.768327  207.474688    27
240  20079.290232    8.000000     8
241  11650.768163    8.000000     8
242   5658.783768    5.359375     8
243   6623.488152   27.000000     8

[244 rows x 3 columns]

## Zero value management

In [92]:
titanic = sns.load_dataset('titanic')

In [93]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [94]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [95]:
titanic.isnull().sum().sum() # number of NaN in the dataframe

869

In [96]:
titanic.dropna()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [97]:
titanic.dropna().reset_index(drop=True) # drop = True is to delete de old index columns, else adds it as a column

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
1,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
2,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
3,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
4,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
177,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
178,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
179,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
180,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
181,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [98]:
titanic.dropna(axis=1, thresh=500)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [99]:
titanic.age.fillna(0)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [100]:
titanic.age.fillna(titanic.age.mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

## Export

In [101]:
tips.to_csv('tips.csv', index=False)

In [102]:
tips.to_csv('tips.csv', index=False, header=False)

In [103]:
df = pd.read_csv('tips.csv', header=None)

In [104]:
df.head()

       0     1       2   3    4       5  6
0  16.99  1.01  Female  No  Sun  Dinner  2
1  10.34  1.66    Male  No  Sun  Dinner  3
2  21.01  3.50    Male  No  Sun  Dinner  3
3  23.68  3.31    Male  No  Sun  Dinner  2
4  24.59  3.61  Female  No  Sun  Dinner  4

In [105]:
tips.to_excel('tips.xlsx', index=False)

In [106]:
df = pd.read_excel('tips.xlsx')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## groupby

In [107]:
tips.groupby(by='day').mean(numeric_only=True)

      total_bill       tip      size
day
Thur   17.682742  2.771452  2.451613
Fri    17.151579  2.734737  2.105263
Sat    20.441379  2.993103  2.517241
Sun    21.410000  3.255132  2.842105

## pivot_table

In [108]:
pd.pivot_table(tips,index= ['day','smoker'], columns='size', values='tip')

size            1         2         3       4     5    6
day  smoker
Thur Yes      NaN  2.713846  3.615000  4.5000   NaN  NaN
     No      1.83  2.341714  1.770000  4.0300  5.00  5.3
Fri  Yes     1.92  2.620000       NaN  4.7300   NaN  NaN
     No       NaN  2.750000  3.000000     NaN   NaN  NaN
Sat  Yes     1.00  2.476786  4.568333  3.3350  3.00  NaN
     No      1.00  2.563200  3.412500  4.8000   NaN  NaN
Sun  Yes      NaN  3.345000  3.625000  5.0900  2.00  NaN
     No       NaN  2.582222  2.937273  3.9625  5.07  5.0